cangalaya/control-aforo-esp8266/src/main.cpp
/* ------------- CONTROL DE AFORO - 2 PUERTAS COMUNICADAS -----------------
 *  Desarrollado por: Ing. Alonso Cangalaya (cangalaya.2007@gmail.com)
 *  Funciones:
 *    - Realiza conteo ABCD (sensores S1 y S2 conectados a este ESP8266)
 *    - Comunicación WiFi con protocolo UDP -> este dispositivo es el MAIN GATE
 *    - Comunicación con el Arduino Nano para mostrar datos en el display
 *    - Comunicación con el Dashboard (LabView) por protocolo UDP
 */

///////////// DEPENDENCIAS ///////////
#include <TimeLib.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h> // Protocolo UDP (transferencia de datos rapida, pero no segura)
//#include <DMDESP.h>               // librería para el display
#include <Separador.h>           // liberia para separa string (se usa para separar valores en la trama de datos de comunicación con el UDP)
#include <Firebase_ESP_Client.h> //#include <Firebase_ESP_Client.h>
#include <EEPROM.h>              // update de memorias fash
//#include <fonts/SystemFont5x7.h>  //liberias para la tipología de fuente a mostrar en pantalla
//#include <fonts/Droid_Sans_12.h>
//#include <fonts/Arial_Black_16.h>
//#include <fonts/Arial14.h>

//--------- Fuentes para el Display ------------------

// const uint8_t *FONT1 = Arial14;
// const uint8_t *FONT2 = Arial_Black_16;
// const uint8_t *FONT3 = SystemFont5x7;
// const uint8_t *FONT4 = Droid_Sans_12;
// const uint8_t *FONT = FONT2;

///// VARIABLES PARA EL RESET DE AFORO ////
int minuto = 0;
int minuto_anterior = 0;
int counter_minutos_inactividad = 0;

//----------------------------------------DMD Configuration (P10 Panel)
//#define DISPLAYS_WIDE 3 //--> Panel Columns         <<<<<<<<<<<<<<< D I S P L A Y   C O L U M N A S <<<<<<<<<<<
//#define DISPLAYS_HIGH 1 //--> Panel Rows
// DMDESP Disp(DISPLAYS_WIDE, DISPLAYS_HIGH);          //Creación de Instancia llamada Disp -> Number of Panels P10 used (Column, Row)
//----------------------------------------
Separador s; // instancia para separar string
//----------------------------------------
// Define Firebase Data object
FirebaseData fbdo;

FirebaseAuth auth;
FirebaseConfig config;

// creación de JSON
FirebaseJson jsonConfigWifi;
FirebaseJson jsonConfigUdp;
FirebaseJson jsonConfigTarjet;
FirebaseJson jsonData;

#include "config.h" // Configurar datos de la red
#include "UDP.hpp"
#include "ESP8266_Utils.hpp"
#include "ESP8266_Utils_UDP.hpp"

//////////// variables FIREBASE   ////////////////

// Provide the token generation process info.
#include <addons/TokenHelper.h>

// Provide the RTDB payload printing info and other helper functions.
#include <addons/RTDBHelper.h>

/* 2. Define the API Key */
#define API_KEY "AIzaSyACwNdd8nTeRCLSr6tFyZLQ-jquw8ljKa8"

/* 3. Define the RTDB URL */
#define DATABASE_URL "prueba-2-e4543-default-rtdb.firebaseio.com" //<databaseName>.firebaseio.com or <databaseName>.<region>.firebasedatabase.app

/* 3. Define the project ID */
#define FIREBASE_PROJECT_ID "prueba-2-e4543"

/* 4. Define the user Email and password that alreadey registerd or added in your project */
#define USER_EMAIL "comedor1@tasa-callao.com"
#define USER_PASSWORD "comedor1"

////// SETEO INICIAL DE DATOS //////////7
void jsonConfigDataSet()
{

  // SETEO DE CONFIGURACIÓN DE TARJET
  jsonConfigTarjet.add("abcd", (EEPROM.read(200) == 255) ? abcd : readStringFromEEPROM(200)); // falta configurar
  jsonConfigTarjet.add("aforo", (EEPROM.read(190) == 255) ? aforo_init : readStringFromEEPROM(190).toInt());
  jsonConfigTarjet.add("count-delay-milisegundos", (EEPROM.read(210) == 255) ? count_dalay_milisegundos : readStringFromEEPROM(210).toInt()); // falta configurar
  jsonConfigTarjet.add("estado", (EEPROM.read(220) == 255) ? estado : readStringFromEEPROM(220));                                             // falta configurar
  jsonConfigTarjet.add("inactivity-hours-reset", (EEPROM.read(230) == 255) ? inactivity_hours_reset : readStringFromEEPROM(230).toFloat());
  jsonConfigTarjet.add("set-data-realtime-segundos", (EEPROM.read(240) == 255) ? set_data_realtime_segundos : readStringFromEEPROM(240).toInt()); // falta configurar

  // SETEO DE CONFIGURACIÓN WIFI
  jsonConfigWifi.add("ssid", (EEPROM.read(0) == 255) ? ssid : readStringFromEEPROM(0));
  jsonConfigWifi.add("password", (EEPROM.read(50) == 255) ? password : readStringFromEEPROM(50));

  // SETEO DE CONFIGURACIÓN UDP
  jsonConfigUdp.add("master-port", (EEPROM.read(150) == 255) ? master_port : readStringFromEEPROM(150).toInt());
  jsonConfigUdp.add("second-port", (EEPROM.read(160) == 255) ? second_port : readStringFromEEPROM(160).toInt());
  jsonConfigUdp.add("datalogger-ip", (EEPROM.read(180) == 255) ? datalogger_ip : readStringFromEEPROM(180).toInt());
  jsonConfigUdp.add("datalogger-port", (EEPROM.read(170) == 255) ? datalogger_port : readStringFromEEPROM(170).toInt());

  // SETEO DE CONFIGURACIÓN DATA - REALTIME
  jsonData.add("egresos", BDatos.egresos);
  jsonData.add("excesos", BDatos.excesos);
  jsonData.add("ingresos", BDatos.ingresos);
  jsonData.add("total", BDatos.total);

  if (Firebase.RTDB.setJSONAsync(&fbdo, path_config + "/wifi", &jsonConfigWifi))
  {
    Serial.println();
    Serial.println("Datos WIFI Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println();
    Serial.println("*** Datos WIFI no establecidos en Firebase");
  }

  if (Firebase.RTDB.setJSONAsync(&fbdo, path_config + "/tarjet", &jsonConfigTarjet))
  {
    Serial.println("Datos TARJET Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println("*** Datos TARJET no establecidos en Firebase");
  }

  if (Firebase.RTDB.setJSONAsync(&fbdo, path_config + "/udp", &jsonConfigUdp))
  {
    Serial.println("Datos UDP Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println("*** Datos UDP no establecidos en Firebase");
  }

  Serial.printf("Set jsonData... %s\n", Firebase.RTDB.setJSONAsync(&fbdo, path_data, &jsonData) ? "ok" : fbdo.errorReason().c_str());
}

//////////// variables para reseteo por inactividad /////////////
unsigned long time_millis = 0;
unsigned long before_time_millis = 0;
unsigned long counter_millis = 0;

//========== variables para la subrutina - censusPeople() ===========

