cangalaya/control-aforo-esp8266/src/main.cpp
//===============================================================================================================================================
//===============================================================================================================================================
// CLOCK ROUTINES

// NTP Servers:
static const char ntpServerName[] = "south-america.pool.ntp.org";

const int timeZone = -5; // Perú

const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
// byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

time_t getNtpTime();
void sendNTPpacket(IPAddress &address);

// REINICIO DE CUENTA
bool reinicioCuenta = true;
void reinicio_de_cuenta()
{
  if (hour() == hora_reinicio && minute() == minuto_reinicio && second() == 0 && reinicioCuenta)
  {
    Serial.print("Reinicio de Cuenta ------ día nuevo\n");
    BDatos.total = 0;
    BDatos.ingresos = 0;
    BDatos.egresos = 0;
    reinicioCuenta = false;
  }
  if (minute() != minuto_reinicio)
    reinicioCuenta = true;
}
unsigned long int PrevMillis = 0;
void envioDataRealtime()
{
  if (millis() < 2000)
    PrevMillis = 0; // protección frente a desborde de millis
  if ((Firebase.ready() && (millis() - PrevMillis > (readStringFromEEPROM(240).toInt() * 1000))) && (counter_millis > 5000))
  {
    Serial.println(">>> Enviando datos RealTime >>>");
    PrevMillis = millis();
    //   int integer = 0;
    //   Firebase.RTDB.getInt(&fbdo, "/tasa/callao/bano-varones/config/aforo") ? integer = fbdo.to<int>() : Serial.print(fbdo.errorReason().c_str());
    //   Serial.println(integer);
    //  FirebaseJson jVal;
    //  Serial.printf("Get json ref... %s\n", Firebase.RTDB.getJSON(&fbdo, "/tasa/callao/bano-varones/config", &jVal) ? jVal.raw() : fbdo.errorReason().c_str());
    jsonData.clear();
    jsonData.set("total", BDatos.total);
    jsonData.set("ingresos", BDatos.ingresos);
    jsonData.set("egresos", BDatos.egresos);
    Serial.printf("Update json... %s\n\n", Firebase.RTDB.updateNodeAsync(&fbdo, path_data + fbdo.pushName(), &jsonData) ? "ok" : fbdo.errorReason().c_str());

    // int aforo_realtime = 0;
    // if (Firebase.RTDB.getInt(&fbdo, F("/tasa/callao/bano-varones/config/aforo/int")))
    // {
    //   aforo_realtime = (fbdo.to<int>());
    //   Serial.println("Aforo realtime = " + String(aforo_realtime));
    // }
    // else
    // {
    //   Serial.println(fbdo.errorReason().c_str());
    // }
  }
}

time_t getNtpTime()
{
  IPAddress ntpServerIP; // NTP server's ip address

  while (UDP.parsePacket() > 0)
    ; // discard any previously received packets
  Serial.println("Transmit NTP Request");
  // get a random server from the pool
  WiFi.hostByName(ntpServerName, ntpServerIP);
  Serial.print(ntpServerName);
  Serial.print(": ");
  Serial.println(ntpServerIP);
  sendNTPpacket(ntpServerIP);
  uint32_t beginWait = millis();
  while (millis() - beginWait < 1500)
  {
    int size = UDP.parsePacket();
    if (size >= NTP_PACKET_SIZE)
    {
      Serial.println("Receive NTP Response");
      UDP.read(packetBuffer, NTP_PACKET_SIZE); // read packet into the buffer
      unsigned long secsSince1900;
      // convert four bytes starting at location 40 to a long integer
      secsSince1900 = (unsigned long)packetBuffer[40] << 24;
      secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
      secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
      secsSince1900 |= (unsigned long)packetBuffer[43];
      return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
    }
  }
  Serial.println("No NTP Response :-(");
  return 0; // return 0 if unable to get the time
}

// send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress &address)
{
  // set all bytes in the buffer to 0
  memset(packetBuffer, 0, NTP_PACKET_SIZE);
  // Initialize values needed to form NTP request
  // (see URL above for details on the packets)
  packetBuffer[0] = 0b11100011; // LI, Version, Mode
  packetBuffer[1] = 0;          // Stratum, or type of clock
  packetBuffer[2] = 6;          // Polling Interval
  packetBuffer[3] = 0xEC;       // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;
  // all NTP fields have been given values, now
  // you can send a packet requesting a timestamp:
  UDP.beginPacket(address, 123); // NTP requests are to port 123
  UDP.write(packetBuffer, NTP_PACKET_SIZE);
  UDP.endPacket();
}

//===============================================================================================================================================
//===============================================================================================================================================

void setup()
{
  delay(1000);
  Serial.begin(9600);
  // ---------------- EEPROM (FLASH MEMORY) ----------
  EEPROM.begin(260);
  //----------------------------------------
  pinMode(PtoBuzzer, OUTPUT); // BUZZER
  delay(2);
  digitalWrite(PtoBuzzer, LOW);
  //-------------------------------------- SENSORES
  pinMode(Sensor_1, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_1), in_people, RISING);

  pinMode(Sensor_2, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_2), out_people, RISING);
  //-------------- WIFI -----------------
  ConnectWiFi_STA();

  // -------------- FIREBASE -------------------------
  Serial.printf("Firebase Client v%s\n\n", FIREBASE_CLIENT_VERSION);

  /* Assign the api key (required) */
  config.api_key = API_KEY;

  /* Assign the user sign in credentials */
  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;

  /* Assign the RTDB URL (required) */
  config.database_url = DATABASE_URL;

  /* Assign the callback function for the long running token generation task */
  config.token_status_callback = tokenStatusCallback; // see addons/TokenHelper.h

