cangalaya/control-aforo-esp8266/src/main.cpp
  // Or use legacy authenticate method
  // config.database_url = DATABASE_URL;
  // config.signer.tokens.legacy_token = "<database secret>";

  Firebase.begin(&config, &auth);

  // Comment or pass false value when WiFi reconnection will control by your code or third party library
  Firebase.reconnectWiFi(true);

  // Optional, use classic HTTP GET and POST requests.
  // This option allows get and delete functions (PUT and DELETE HTTP requests) works for
  // device connected behind the Firewall that allows only GET and POST requests.
  Firebase.RTDB.enableClassicRequest(&fbdo, true);

  /// ------ EPROM INIT ----
  setCofigEprom();
  jsonConfigDataSet();

  /// ---- SETEO DE CONFIGURACIÓN INICIAL  ----
  BDatos.aforo = readStringFromEEPROM(190).toInt();
  horas_inactividad_max = readStringFromEEPROM(230).toFloat();

  localPort = readStringFromEEPROM(150).toInt();
  remotePort = readStringFromEEPROM(160).toInt();
  remotePortDashboard = readStringFromEEPROM(170).toInt();

  remoteIP_dashboard[0] = WiFi.localIP()[0];
  remoteIP_dashboard[1] = WiFi.localIP()[1];
  remoteIP_dashboard[2] = WiFi.localIP()[2];
  remoteIP_dashboard[3] = readStringFromEEPROM(180).toInt();

  /// ---- UDP INIT -----
  ConnectUDP();
  //--------------- CLOCK NTP SERVER ----------------
  setSyncProvider(getNtpTime);
  setSyncInterval(300);
}

int inicio_r = 0;
unsigned int refresh = 0; // variable para enviar datos cada 2 segundos, sistema de defensa frente a perdida de datos udp

void loop()
{
  reinicio_de_cuenta(); // reinicio a 0 de ingresos, egresos y total cuando ocurre un nuevo día.
  envioDataRealtime();  // envio de data realtime
  actualizarConfigFlash();
  GetUDP_Packet(false); // esperar a que llegen paquetes

  time_millis = millis();
  if (time_millis < 500)
  {                         // cuando millis desb orde despues de 50d aprox.
    before_time_millis = 0; // volvemos el tiempo_aux a 0;
  }

  if (before_time_millis != time_millis)
  {
    before_time_millis = time_millis;
    counter_millis++;
    // Serial.println("Segundos transcurridos: " + String(counter_millis));
  }
  if (counter_millis >= (3600000 * horas_inactividad_max))
  { //(60000*horas_inactividad_max)    60000 = 1min    1hora(60min)= 3600000
    BDatos.total = 0;
    counter_millis = 0;
    Serial.println("Reseteo del total por tiempo de innactividad");
  }

  if (inicio_r == 0) // condicional puesta el setear datos cuando cualquiera de las 2 puertas se apaga repentinamente
  {
    inicio_r = 1;
    // actualizar_pantalla();
    mandar_data_display(); //<<<<<<<<
    // BDatos.estado_inicial = 1;                      //salimos del estado incial
    SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    BDatos.estado_inicial = 1; // salimos del estado incial
  }

  if (flag_send_data == 1) // condicional para enviar datos iniciales
  {
    flag_send_data = 0;
    SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    ////////////////////////////// ENVIO DE DATOS AL DASHBOARD //////////////////////////////
    SendUDP_Packet_Dashboard(String() + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
    mandar_data_display(); //<<<<<<<<
    Serial.println("Datos Enviados");
  }

  // ESCRIBIR EN DATABASE FIRESTORE
  // if ((Firebase.ready() && (millis() - PrevMillis > 5000)) || PrevMillis == 0)
  // {
  //   PrevMillis = millis();
  //   String timeStamp = String(String(year()) + "-" + String(month()) + "-" + String(day()) + "--" + String(hour()) + "-" + String(minute()));
  //   Serial.println(timeStamp);

  //   documentPath = "tasa/pisco-sur/comedor-secundario/" + timeStamp;

  //   // If the document path contains space e.g. "a b c/d e f"
  //   // It should encode the space as %20 then the path will be "a%20b%20c/d%20e%20f"

  //   content.clear();
  //   content.set("fields/aforo/integerValue", String(BDatos.aforo).c_str());
  //   content.set("fields/total/integerValue", String(BDatos.total).c_str());
  //   content.set("fields/egresos/integerValue", String(BDatos.egresos).c_str());
  //   content.set("fields/ingresos/integerValue", String(BDatos.ingresos).c_str());
  //   //content.set("fields/excesos/integerValue", String(random(1, 20)).c_str());

  //   Serial.print("Create a document... ");

  //   if (Firebase.Firestore.createDocument(&fbdo, FIREBASE_PROJECT_ID, "" /* databaseId can be (default) or empty */, documentPath.c_str(), content.raw()))
  //     Serial.printf("ok\n%s\n\n", fbdo.payload().c_str());
  //   else
  //     Serial.println(fbdo.errorReason());
  // }

  //// OBTENCION DE VALORES INT DE REALTIME FIREBASE EJECUTAR EN INTERVALOS DE HORAS
  // if ((Firebase.ready() && (millis() - PrevMillis > 5000) || PrevMillis == 0))
  // {
  //   PrevMillis = millis();
  //   int integer = 0;
  //   Firebase.RTDB.getInt(&fbdo, "/tasa/callao/bano-varones/config/aforo") ? integer = fbdo.to<int>() : Serial.print(fbdo.errorReason().c_str());
  //   Serial.println(integer);
  // }
  if (counter_millis >= readStringFromEEPROM(210).toInt())  // seteo de tiempo de espera para iniciar otro conteo
    censusPeople();
  // Sesado de personas saliendo o ingresado. Actualiza BDatos.local y lo envia al otro esp
  refresh++;
  if (refresh == 65000)
  {
    refresh = 0;
    flag_send_data = 1;
  }
}